---
kind: enumMember
id: F:Autodesk.Revit.DB.ShellLayerType.Exterior
enum: Autodesk.Revit.DB.ShellLayerType
source: html/75c640b9-9904-7882-43fc-a4dfc25ff53c.htm
---
# Autodesk.Revit.DB.ShellLayerType.Exterior

Exterior shell layer.